In [6]:
import pandas as pd
import datetime
import numpy as np

In [7]:
dates = pd.date_range(datetime.date.today(), periods=6)
dates

DatetimeIndex(['2023-03-27', '2023-03-28', '2023-03-29', '2023-03-30',
               '2023-03-31', '2023-04-01'],
              dtype='datetime64[ns]', freq='D')

In [39]:
data = [
    [1,2,3,4],
    [5,6,7,8],
    [9,1,2,3],
    [4,5,6,7],
    [8,9,1,2],
    [3,4,5,6]
]
df = pd.DataFrame(data, index=dates, columns=list('ABCD'))

In [40]:
df

            A  B  C  D
2023-03-27  1  2  3  4
2023-03-28  5  6  7  8
2023-03-29  9  1  2  3
2023-03-30  4  5  6  7
2023-03-31  8  9  1  2
2023-04-01  3  4  5  6

In [41]:
df.index

DatetimeIndex(['2023-03-27', '2023-03-28', '2023-03-29', '2023-03-30',
               '2023-03-31', '2023-04-01'],
              dtype='datetime64[ns]', freq='D')

In [42]:
df.to_numpy()

array([[1, 2, 3, 4],
       [5, 6, 7, 8],
       [9, 1, 2, 3],
       [4, 5, 6, 7],
       [8, 9, 1, 2],
       [3, 4, 5, 6]], dtype=int64)

In [43]:
df.describe()

             A         B         C         D
count  6.00000  6.000000  6.000000  6.000000
mean   5.00000  4.500000  4.000000  5.000000
std    3.03315  2.880972  2.366432  2.366432
min    1.00000  1.000000  1.000000  2.000000
25%    3.25000  2.500000  2.250000  3.250000
50%    4.50000  4.500000  4.000000  5.000000
75%    7.25000  5.750000  5.750000  6.750000
max    9.00000  9.000000  7.000000  8.000000

In [44]:
df['A'].sum()

30

In [46]:
sum = 0
for letter in list('ABCD'):
    sum += df[letter].sum()
sum

111

In [49]:
df.T

   2023-03-27  2023-03-28  2023-03-29  2023-03-30  2023-03-31  2023-04-01
A           1           5           9           4           8           3
B           2           6           1           5           9           4
C           3           7           2           6           1           5
D           4           8           3           7           2           6

In [76]:
df2 = pd.DataFrame({'B': [1,2,3], 'C': [3,2,1], 'A': [2,3,1], 'D': [1,3,2]}, index=['muffin', 'dog', 'cat'])
df2

        B  C  A  D
muffin  1  3  2  1
dog     2  2  3  3
cat     3  1  1  2

In [77]:
df2.sort_values(by='A')

        B  C  A  D
cat     3  1  1  2
muffin  1  3  2  1
dog     2  2  3  3

In [78]:
df2.sort_index(axis=0)

        B  C  A  D
cat     3  1  1  2
dog     2  2  3  3
muffin  1  3  2  1

In [79]:
df2.sort_index(axis=1)

        A  B  C  D
muffin  2  1  3  1
dog     3  2  2  3
cat     1  3  1  2

In [80]:
for row in df2['A']:
    print(row)

2
3
1

In [97]:
df2[["A", "B"]]

        A  B
muffin  2  1
dog     3  2
cat     1  3

In [98]:
df3 = pd.DataFrame({
    "name": ['Tom', 'Jerry', 'Harry'],
    "age": [17, 25, 21],
    "job": ['plumber', 'teacher', 'programmer']
})
df3

    name  age         job
0    Tom   17     plumber
1  Jerry   25     teacher
2  Harry   21  programmer

In [99]:
df3.to_csv('new_csv.csv')